#print((-0.001372*1000000-0.000009*1000000)/1000000)
from decimal import Decimal
from decimal import getcontext
#69966.48528605
print(Decimal('199999867.2137776000000000')*Decimal('0.020217'))   #e
print(Decimal('200000131.6563827042314000'))   #b
print(Decimal('198796810.0156400929400000')/Decimal('9446.17'))   #u
print((Decimal('199999867.2137776000000000')*Decimal('0.020217'))+(Decimal('200000131.656382'))+(Decimal('198796810.0156400929400000')/Decimal('9446.17')))

a = 10000

def jg1(n):
    #a=10000
    a =(11000 - 10000 )/((3600-10*n)/10)+ 10000
    print(a)
n=0
for n in range(360):
    n=n+1
    jg1(n)


204034271.269037

#买1=外部市场价*[1-盘口价差值（固定值）]
#卖1=外部市场价*[1+盘口价差值（固定值）]
#买N=买1-（成交价-买1）*（N-1）*（50%～100%随机值）
#卖N=卖1+（卖1-成交价）*（N-1）*（50%～100%随机值）

'''print(Decimal('158.6')*Decimal('0.9995'))
print(Decimal('158.6')*Decimal('1.0005'))

def jg(n):
    print(Decimal('158.52070') - (Decimal('158.6') - Decimal('158.52070')) * n * 1)

n=1
for n in range(20):
    n=n+1
    jg(n) 
'''


    # 买1=外部市场价*[1-盘口价差值（固定值）]
    # 卖1=外部市场价*[1+盘口价差值（固定值）]
    # 买N=买1-（成交价-买1）*（N-1）*（50%～100%随机值）
    # 卖N=卖1+（卖1-成交价）*（N-1）*（50%～100%随机值）
'''def jg(n):
    print(Decimal('158.67930') + (Decimal('158.67930')-Decimal('158.6')) * n * Decimal('0.5'))

n=1
for n in range(20):
    n=n+1
    jg(n)
'''